{
    "0" : {
        "image": "autoecole",
        "fr": {
            "title": "Site d'auto-école",
            "resume": "Un site web réalisé à partir de zéro dans le cadre d'un cours traitant les bases de données, le nom des pages était imposé.",
            "content": "<p>Il s'agit d'un site web que j'ai entièrement réalisé à partir de zéro, de l'architecture au design. Les différentes pages accessibles étaient imposées. Les technologies utilisées sont HTML, CSS, Javascript, JQuery, PHP, MySQL ainsi que le framework <a href='https://developers.google.com/chart/' target='_blank'>Google Charts</a>. Aucun template n'a été utilisé. Vous pouvez dès à présent <a class='go' href='http://guillaumejounel.com/autoecole' target='_blank'>consulter le site</a> ou continuer avec ma visite guidée ci-dessous.</p><p>Le site dispose à l'acceuil de compteurs statistiques en temps réel ainsi que d'un bouton permettant de réinitialiser la base de données avec des données de démonstration.</p><img src='/img/articles/autoecole/auto1.png' alt='screenshot site autoecole'/><p>Il est possible d'ajouter des élèves, d'indiquer leurs caractéristiques, de les supprimer et de les consulter. Une recherche dynamique permet de rapidement trouver l'élève désiré. Il suffit d'appuyer sur la touche entrée pour accéder aux informations de l'élève en premier résultat.</p><img src='/img/articles/autoecole/auto2.png' alt='screenshot site autoecole'/><p>Il est aussi possible de planifier des séances thématiques de code et d'y inscrire des élèves. Une fois la séance passée, il est possible d'entrer la note que chaque élève a obtenu afin de pouvoir consulter les statistiques d'un élève.</p><img src='/img/articles/autoecole/auto3.png' alt='screenshot site autoecole'/><p>Les statistiques d'un élève peuvent être filtrées par thématiques. Elles présentent son nombre moyen de fautes par séance, sa répartition des notes ou encore son pourcentage de réussite.</p><img src='/img/articles/autoecole/auto4.png' alt='screenshot site autoecole'/><p>Un graphe présente également l'évolution des résultats de l'élève par thématique, ce qui permet rapidement d'identifier ses points faibles et ses points forts.</p><img src='/img/articles/autoecole/auto5.png' alt='screenshot site autoecole'/><p>Non seulement les statistiques globales présentent les mêmes informations que pour chaque élève, mais également un calendrier représentant la fréquentation de l'auto-école au cours de l'année.</p><img src='/img/articles/autoecole/auto6.png' alt='screenshot site autoecole'/><p>J'espère que cette réalisation vous a plu, n'hésitez pas à <a class='go' href='http://guillaumejounel.com/autoecole' target='_blank'>la consulter</a> par vous-même afin d'en apprécier tous les détails que je me suis fait une joie de peaufiner.</p>",
            "keywords": ["Projet académique","HTML/CSS", "PHP", "MySQL", "Google Charts"]
        },
        "en": {
            "title": "Driving School website",
            "resume": "A fake driving school website fully coded from scratch for academic purpose. Page names were imposed.",
            "content": "<p>This is a website I have fully developed from scratch. All the pages were imposed by the teacher (in French). Technologies used are HTML, CSS, Javascript, JQuery, PHP, MySQL and <a href='https://developers.google.com/chart/' target='_blank'>Google Charts</a> framework. No template were used. You can <a class='go' href='http://guillaumejounel.com/autoecole' target='_blank'>check out the website</a> or keep reading this article as I'm giving you a guided tour.</p><p>The website homepage has a few real time counters as well as a database reset button that loads a demonstration dataset.</p><img src='/img/articles/autoecole/auto1.png' alt='screenshot site autoecole'/><p>It allows to add students, register their attributes, delete them and consult their profile. A dynamic search let you find quickly the desired student. Pressing the enter key let you immediately access the student profile.</p><img src='/img/articles/autoecole/auto2.png' alt='screenshot site autoecole'/><p>It is also possible to plan thematic classroom sessions and to enroll students. Once the session is done, a score can be assigned to each student, which will be part of his statistics.</p><img src='/img/articles/autoecole/auto3.png' alt='screenshot site autoecole'/><p>Student statistics can be filtered by topic. It displays their average number of mistakes per session, their score distribution and also their percentage of success (in France, a driving school exam is failed if more than 5 mistakes are made).</p><img src='/img/articles/autoecole/auto4.png' alt='screenshot site autoecole'/><p>Results evolution of the student are also displayed per topic on a plot, letting us to quickly identify his strong and weak points.</p><img src='/img/articles/autoecole/auto5.png' alt='screenshot site autoecole'/><p>Not only are global statistics displaying the same information as personal statistics, but also a driving-school frequentation calendar over the years.</p><img src='/img/articles/autoecole/auto6.png' alt='screenshot site autoecole'/><p>I hope you enjoyed this realisation, please feel free to <a class='go' href='http://guillaumejounel.com/autoecole' target='_blank'>check it out</a> by yourself so that you can appreciate all the details I took delight to polish. You can also read my code <a href='https://github.com/guillaumejounel/autoecole' target='_blank'>on GitHub</a>.</p>",
            "keywords": ["Academic project","HTML/CSS", "PHP", "MySQL", "Google Charts"]
        }
    },
    "1" : {
        "image": "thenatureofcode",
        "fr": {
            "title": "The Nature of Code",
            "resume": "Reproduire la nature. Un beau défi relevé dans ce livre de Daniel Shiffman, utilisant le code comme moyen d'expression artistique.",
            "content": "<p><i>The Nature of Code</i> est un excellent livre de programmation écrit par Daniel Shiffman, un brillant Youtuber et professeur New-Yorkais débordant d'énergie. En lisant ce livre (disponible <a class='go' href='http://natureofcode.com' target='_blank'>en ligne</a> gratuitement), vous apprendrez à simuler des systèmes naturels à l'aide de <a href='https://processing.org' target='_blank'>Processing</a> (un language de programmation destiné aux arts visuels, adapté en Javascript via le framework p5.js), avec une brève introduction à la théorie de la physique, aux systèmes de particules, aux agents autonomes, aux automates cellulaires, aux fractales, aux algorithmes génétiques ainsi qu'aux réseaux de neurones.</p><p>J'apprécie vraiment la philosophie de vie de Dan, il m'a convaincu que je pouvais fusionner ma sensibilité artistique à ma passion pour la programmation. Je recommande particulièrement ce livre que j'aurais aimé découvrir bien plus tôt. Daniel Shiffman tient également une chaîne Youtube, <a class='go' href='https://www.youtube.com/user/shiffman' target='_blank'>The Coding Train</a>, sur laquelle il publie régulièrement des \"Coding Challenge\", rendant la programmation créative accessible à tous. Ci-dessous, un exemple d'une de ses vidéos, j'espère que vous allez apprécier.</p> <iframe width='560' height='315' src='https://www.youtube.com/embed/ccYLb7cLB1I' frameborder='0' allowfullscreen class='video'></iframe><p>N'hésitez pas à visionner ses autres vidéos sur Youtube ! Comme vu l'avez peut-être remarqué, le fond animé de mon site est interactif et est développé en Javascript à l'aide de p5.js, inspiré par les travaux de Dan. Restez connecté, je vous dévoilerai d'autres de mes créations sous Processing dans les prochains jours !</p>",
            "keywords": ["Livre","Inspiration", "Art", "p5.js", "Daniel Shiffman", "Javascript"]
        },
        "en": {
            "title": "The Nature of Code",
            "resume": "Simulate nature. A beautiful challenge took by Daniel Shiffman through this book, using coding as a mean of artistic expression.",
            "content": "<p><i>The Nature of Code</i> is an awesome programming book written by Daniel Shiffman, an enthusiastic and brillant Youtuber and professor at ITP NYU I'm really keen on. If you read this book (available <a class='go' href='http://natureofcode.com' target='_blank'>online</a> for free), it will teach you how to simulate natural systems using <a href='https://processing.org' target='_blank'>Processing</a> (a programming language for visual arts, available as a Javascript framework p5.js), with an brief introduction to the theory of physics, particle systems, autonomous agents, cellular automata, fractals, genetic algorithms and neural networks.</p><p>I really appreciate Dan's philosophy of life, he literally convinced me that I could merge my passions for coding and art. I definitely recommend this book I would have liked to read earlier. Daniel Shiffman also manages a Youtube channel, <a class='go' href='https://www.youtube.com/user/shiffman' target='_blank'>The Coding Train</a>, and he regularly uploads cool coding challenges making creative programming accessible to everyone. Below is an coding challenge example, I hope you'll enjoy it.</p> <iframe width='560' height='315' src='https://www.youtube.com/embed/ccYLb7cLB1I' frameborder='0' allowfullscreen class='video'></iframe><p>Do not hesitate to check out his other videos on Youtube! As you may have noticed, my website animated background is interactive and his precisely developed in Javascript with p5.js, inspired by Dan's work. Stay tunned, I'll show you more stuff I programmed with Processing in the following days!</p>",
            "keywords": ["Book","Inspiration", "Art", "p5.js", "Daniel Shiffman", "Javascript"]
        }
    },
    "2" : {
        "image": "graph-api",
        "fr": {
            "title": "Facebook Graph API",
            "resume": "J'ai développé de nombreuses expériences amusantes et innovantes sur Facebook, créant des interactions avec les gens.",
            "content": "<p>La <a href='https://developers.facebook.com/docs/graph-api' target='_blank'>Graph API</a> est une API puissante mise à disposition par Facebook qui permet d'interagir simplement avec le réseau social par la programmation (navigation, publication...). Voici quelques réalisations que je me suis amusé à faire :</p><h4>Manager de page Facebook basé sur les Hashtags</h4><p>Il s'agit d'un script que j'ai codé au lycée, qui peut être lancé régulièrement (toutes les heures par exemple). Ainsi, toutes les heures, ce script enregistre l'ensemble des nouvelles publications de fans sur une page facebook en les classifiant selon les hashtags qui y sont présent. Des règles peuvent alors être définies telles que 'la page Facebook publie à 20h la publication de fan taguée #ConcoursPhoto ayant eu le plus de like depuis 1 semaine', ce qui permet d'organiser automatiquement un concours photo (la photo sera publiée avec un filigrane ainsi que la mention 'Publication proposée par XXX'). D'autres règles peuvent être utilisées, comme publier les publications aux hashtags les plus aimés (inspiré des Tendances sur Twitter). Il est ainsi possible d'avoir une page Facebook collaborative dont l'animation est basée sur les publications des fans. À l'époque, je n'avais pas GitHub et je n'ai donc pas publié le code, mais n'hésitez pas à me contacter si le concept vous intéresse et si vous aimeriez l'intégrer à votre page Facebook.</p><h4>Analyse des données d'un groupe Facebook</h4><p>Grâce à la Graph API, j'ai réussi à télécharger l'ensemble des données du groupe Facebook de mon école d'ingénieur, soit environ 100Mo. J'ai pu réaliser quelques statistiques telles que le nombre de publications, les mots les plus utilisés et les publications les plus populaires, mais je ferai probablement un traitement plus avancé de ces données dans les prochains mois.</p><h4>Bot donnant chaque jour les devoirs à faire pour le lendemain.</h4><img src='../img/articles/graph-api/chuck.png' alt='chucknauriss'/><p>Au lycée, j'ai crée un bot Facebook nommé 'Chuck Nauriss', qui chaque jour publiait automatiquement sur le groupe Facebook de ma classe les devoirs qu'il y avait à faire pour le lendemain. À partir d'une interface web collaborative simple, n'importe qui pouvait consulter les devoirs, les noter comme 'fait' ou encore en ajouter des nouveaux.</p>",
            "keywords": ["Facebook","Projet personnel", "Graph API", "PHP", "Expériences"]
        },
        "en": {
            "title": "Facebook Graph API",
            "resume": "I've developed a lot of fun and innovative experiments on Facebook, directly interacting with people.",
            "content": "<p><a href='https://developers.facebook.com/docs/graph-api' target='_blank'>Graph API</a> is a powerful API available from Facebook, alowing anybody to easily interact with the social network through programmation (navigate, post...). Below are a few realizations I did:</p><h4>Facebook Page Manager Based on Hashtags</h4><p>It's a script I developed when I was in high school, that can be regularly executed (every hour for example). Thus, every hour, the script stores each new publication by fans on a Facebook page, classifying them according to their potential hashtags. Rules can be defined such as 'the Facebook page publish the most liked fan publication with the hashtag #PhotoContest since last week at 8pm', which makes possible to automatically organize a photo contest on a Facebook page (the photo can be published with a watermark as well as a information such as 'Publication suggested by XXX'). Other rules can be used, for instance, publishing the publications with the most popular hashtags (inspired by the Twitter trends). This makes it possible to manage a collaborative Facebook page which animation is based on fan publications. At that time, I didn't have GitHub so I haven't published my code, but do not hesitate to contact me if you're interested in it and if you would like to include it in your Facebook page.</p><h4>Facebook Group Data Analysis</h4><p>Thanks to Graph API, I managed to download all data from my University's Facebook group, that's almost 100Mb. I have computed a few statistics on it, such as the number of publications, the most used words and the most popular publications, but I'll probably do a more sophisticated data processing in the following months.</p><h4>A Homework Remainder Bot.</h4><img src='../img/articles/graph-api/chuck.png' alt='chucknauriss'/><p>In high school, I developed a Facebook bot named 'Chuck Nauriss', who was used to automatically publish everyday on my class Facebook group the homeworks to do for the next day. Thanks to a simple collaborative web interface, anybody could look at the homeworks, mark them as done and also add new homeworks.</p>",
            "keywords": ["Facebook","Personal project", "Graph API", "PHP", "Experiments"]
        }
    }
}
